#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [21s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring_weu.azurerm_application_insights_standard_web_test.web_tests["SpidL2-lepidaid"] will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "web_tests" {
      ~ enabled                 = false -> true
        id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/webTests/SpidL2-lepidaid-test-io-p-ai-common"
        name                    = "SpidL2-lepidaid-test-io-p-ai-common"
        tags                    = {}
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.azurerm_subnet.platform_api_gateway will be created
  + resource "azurerm_subnet" "platform_api_gateway" {
      + address_prefixes                              = [
          + "10.20.101.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-platform-api-gateway-snet-01"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"
    }

  # module.apim_itn.module.apim.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01"
        name                          = "io-p-itn-apim-01"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.apim_itn.module.apim.azurerm_network_security_group.nsg_apim will be updated in-place
  ~ resource "azurerm_network_security_group" "nsg_apim" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/networkSecurityGroups/io-p-itn-apim-nsg-01"
        name                = "io-p-itn-apim-nsg-01"
      ~ tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.apim_itn.module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-p-itn-apim-01"
        name                = "io-p-itn-apim-01"
      ~ tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (5 unchanged attributes hidden)
    }

  # module.apim_itn.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-p-itn-apim-01"
        name                = "io-p-itn-apim-01"
      ~ tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (5 unchanged attributes hidden)
    }

  # module.apim_itn.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-p-itn-apim-01"
        name                = "io-p-itn-apim-01"
      ~ tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (5 unchanged attributes hidden)
    }

  # module.github_runner_itn.module.container_app_github_runner.azurerm_container_app_job.github_runner will be updated in-place
  ~ resource "azurerm_container_app_job" "github_runner" {
        id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-github-runner-rg-01/providers/Microsoft.App/jobs/io-p-itn-io-infra-caj-01"
        name                         = "io-p-itn-io-infra-caj-01"
      ~ tags                         = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "github_selfhosted_runner_on_container_app_jobs"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + min_api_version               = "2021-08-01"
      + name                          = "io-p-itn-platform-api-gateway-apim-01"
      + notification_sender_email     = (sensitive value)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = false
      + publisher_email               = (sensitive value)
      + publisher_name                = "IO"
      + resource_group_name           = "io-p-itn-common-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "Premium_2"
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_type          = "Internal"
      + zones                         = [
          + "1",
          + "2",
        ]

      + delegation (known after apply)

      + hostname_configuration {
          + proxy {
              + certificate_source           = (known after apply)
              + certificate_status           = (known after apply)
              + default_ssl_binding          = false
              + expiry                       = (known after apply)
              + host_name                    = "io-p-itn-platform-api-gateway-apim-01.azure-api.net"
              + negotiate_client_certificate = false
              + subject                      = (known after apply)
              + thumbprint                   = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up {
          + enabled = false

          + terms_of_service {
              + consent_required = false
              + enabled          = false
            }
        }

      + tenant_access (known after apply)

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management_diagnostic.applicationinsights[0] will be created
  + resource "azurerm_api_management_diagnostic" "applicationinsights" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "io-p-itn-platform-api-gateway-apim-01"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = (known after apply)
      + resource_group_name       = "io-p-itn-common-rg-01"
      + sampling_percentage       = 5
      + verbosity                 = "error"

      + backend_request (known after apply)

      + backend_response (known after apply)

      + frontend_request (known after apply)

      + frontend_response (known after apply)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management_logger.this[0] will be created
  + resource "azurerm_api_management_logger" "this" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "io-p-itn-platform-api-gateway-apim-01-logger"
      + resource_group_name = "io-p-itn-common-rg-01"
      + resource_id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"

      + application_insights {
          + connection_string = (sensitive value)
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_monitor_autoscale_setting.this[0] will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-platform-api-gateway-apim-as-01"
      + resource_group_name = "io-p-itn-common-rg-01"
      + target_resource_id  = (known after apply)

      + profile {
          + name = "default"

          + capacity {
              + default = 3
              + maximum = 10
              + minimum = 1
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Capacity"
                  + metric_namespace         = "microsoft.apimanagement/service"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 50
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT3M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Capacity"
                  + metric_namespace         = "microsoft.apimanagement/service"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 20
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_monitor_diagnostic_setting.apim[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "apim" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.OperationalInsights/workspaces/io-p-law-common"
      + name                           = "io-p-itn-platform-api-gateway-apim-01-diagnostic"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category_group = "audit"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_monitor_metric_alert.this["capacity"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "IO API Gateway Apim used capacity is too high. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/791642113/APIM+Capacity"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-platform-api-gateway-apim-01-CAPACITY"
      + resource_group_name      = "io-p-itn-common-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Capacity"
          + metric_namespace       = "Microsoft.ApiManagement/service"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 60
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_monitor_metric_alert.this["duration"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "IO API Gateway Apim abnormal response time"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-platform-api-gateway-apim-01-DURATION"
      + resource_group_name      = "io-p-itn-common-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Average"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 2
          + evaluation_total_count   = 2
          + ignore_data_before       = "2025-01-01T00:00:00Z"
          + metric_name              = "Duration"
          + metric_namespace         = "Microsoft.ApiManagement/service"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_monitor_metric_alert.this["requests_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "IO API Gateway Apim abnormal failed requests"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-platform-api-gateway-apim-01-REQUESTS_FAILED"
      + resource_group_name      = "io-p-itn-common-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 2
          + evaluation_total_count   = 2
          + ignore_data_before       = "2025-01-01T00:00:00Z"
          + metric_name              = "Requests"
          + metric_namespace         = "Microsoft.ApiManagement/service"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false

          + dimension {
              + name     = "BackendResponseCode"
              + operator = "Include"
              + values   = [
                  + "5xx",
                ]
            }
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_network_security_group.nsg_apim will be created
  + resource "azurerm_network_security_group" "nsg_apim" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-platform-api-gateway-apim-nsg-01"
      + resource_group_name = "io-p-itn-common-rg-01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "managementapim"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_private_dns_a_record.apim_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-platform-api-gateway-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-rg-common"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + ttl                 = 3600
      + zone_name           = "azure-api.net"
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_private_dns_a_record.apim_management_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-platform-api-gateway-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-rg-common"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + ttl                 = 3600
      + zone_name           = "management.azure-api.net"
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_private_dns_a_record.apim_scm_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-platform-api-gateway-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-rg-common"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.4"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + ttl                 = 3600
      + zone_name           = "scm.azure-api.net"
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_subnet_network_security_group_association.snet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.platform_api_gateway_apim_itn.module.iam_adgroup_product_admins.module.apim.azurerm_role_assignment.this["io-p-itn-common-rg-01|io-p-itn-platform-api-gateway-apim-01|owner"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + description                      = "Platform team admin group"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.platform_api_gateway_apim_itn.module.iam_adgroup_product_admins.module.key_vault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

Plan: 15 to add, 8 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.assets_cdn_weu.module.assets_cdn.azurerm_storage_account.this,
  on .terraform/modules/assets_cdn_weu.assets_cdn/storage_account/main.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider

(and 18 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
